<a href="https://colab.research.google.com/github/0x31nose/python_tutorial_with_Colab/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas

In [1]:
import pandas as pd
import numpy as np

## Series

In [3]:
# dictionaryからSeriesを作る
data = {
    'Name': 'John',
    'Sex': 'male',
    'Age': 22
}

In [4]:
pd.Series(data)

Name    John
Sex     male
Age       22
dtype: object

In [5]:
# NumPy Arrayから作成
# NumPyArrayで作成する場合はインデックスが振られる。（0から3）
array = np.array([22, 31, 42, 23])
age_series = pd.Series(array)

In [6]:
# インデックス番号だと扱いづらいのでラベルをつける
array = np.array(['John', 'male', 22])
# Seriesのラベルを指定して値を取り出す
john_series = pd.Series(array, index=['Name', 'Sex', 'Age'])
# 指定したラベルで取り出す
john_series['Name']

'John'

In [7]:
# .valuesで値をNumpyとして扱うことが出来る
age_series.values

array([22, 31, 42, 23])

In [8]:
# Numpyと同じように統計量を計算可能
age_series.mean()

29.5

### DataFrame

In [9]:
# Numpy Array から作成
ndarray = np.arange(10).reshape(2, 5)
ndarray

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

In [10]:
# index=[] で行のインデックスを指定可能
# columns=[] で列のインデックスを指定可能
#　文字列で指定しないと、０から始まるインデックスが自動的に割り振られる
pd.DataFrame(ndarray, index= ['index1', 'index2'], columns=['a', 'b', 'c', 'd', 'e'])

        a  b  c  d  e
index1  0  1  2  3  4
index2  5  6  7  8  9

In [11]:
# DictionaryからDataFrameを作成する
data1 = {
    'name': 'John',
    'sex': 'male',
    'age': 22,
}
data2 = {
    'name': 'Hanako',
    'sex': 'female',
    'age': 29,
}
data3 = {
    'name': 'Alex',
    'sex': 'male',
    'age': 20,
}
data4 = {
    'name' : 'Corina',
    'sex' : 'female',
    'age' : 25,
}
# pd.DataFrame内にリスト形式で入れると、上記と同じように表形式に整理できる
# 行のインデックスを指定していないので、０から始まるインデックスで指定されていることがわかる
# この書き方だと、レコード数が多くなると書き方が大変

pd.DataFrame([data1, data2, data3, data4])

     name     sex  age
0    John    male   22
1  Hanako  female   29
2    Alex    male   20
3  Corina  female   25

In [12]:
#　DictionaryのValueをインデックスとすることも出来て、作成が楽。
data = {
    'name': ['Jack', 'Eitan', 'Laura', 'Briana'],
    'sex': ['male', 'male', 'female', 'female'],
    'age': [34, 45, 25, 23],
}
# DataFrameのデータ量は大きくなりがち。何十万から何百万のデータになってしまう。
# 一つのコードの中で複数のDatFrameを入れることが難しくなる（メモリが溢れてしまう）
# そのため、dfという変数を使い回すことが多い。
df = pd.DataFrame(data)
df

     name     sex  age
0    Jack    male   34
1   Eitan    male   45
2   Laura  female   25
3  Briana  female   23

In [5]:
# csvからデータを読み込んでDataFrameに使っていく。
# .head()で表の上から５件のレコードを表示することが出来る。
#　すべてのデータを表示させず、headを使う。どんなデータかな？と見る際に便利。
df = pd.read_csv('/content/drive/My Drive/Colab Notebooks/Python_tutorial/tmdb_5000_movies.csv')
df.head(3)

      budget  ... vote_count
0  237000000  ...      11800
1  300000000  ...       4500
2  245000000  ...       4466

[3 rows x 20 columns]

In [4]:
# データが何行あるか確認する
# この例では、4803行存在している。
len(df)

4803

In [20]:
# カラムを省略せずにすべて表示する
# pd.set_option('display.max_columns', None)

# 行を省略せずにすべて表示する
# pd.set_option('display.max_rows', None)

# エクセルのファイルを開いたときのように、すべてのデータを表示することはめったに無い。
# Pythonでは、必要なデータだけを抽出することが多い。（RAMの無駄のため。）
# 上記のコードを実行するとずっと保持されてしまうので、上記のタブからランタイムを再起動する

## df.describe()

In [13]:
#  .describe()で、統計量を確認する。一発で出してくれるので便利。（数値項目に限定される）
# Budgetの最小値が0だったらおかしい。
df.describe()
# df.describe()も新しいデータフレームであることがわかる。
# type(df.describe())

             budget             id  ...  vote_average    vote_count
count  4.803000e+03    4803.000000  ...   4803.000000   4803.000000
mean   2.904504e+07   57165.484281  ...      6.092172    690.217989
std    4.072239e+07   88694.614033  ...      1.194612   1234.585891
min    0.000000e+00       5.000000  ...      0.000000      0.000000
25%    7.900000e+05    9014.500000  ...      5.600000     54.000000
50%    1.500000e+07   14629.000000  ...      6.200000    235.000000
75%    4.000000e+07   58610.500000  ...      6.800000    737.000000
max    3.800000e+08  459488.000000  ...     10.000000  13752.000000

[8 rows x 7 columns]

In [15]:
# このdfのカラムの一覧を見る事が出来る
df.columns

Index(['budget', 'genres', 'homepage', 'id', 'keywords', 'original_language',
       'original_title', 'overview', 'popularity', 'production_companies',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'tagline', 'title', 'vote_average',
       'vote_count'],
      dtype='object')

In [19]:
# df['カラム名']で、特定のカラムのSeriesを取得出来る
# df['revenue']
df['popularity']

# typeで調べると、seriesであることがわかる
type(df['popularity'])

pandas.core.series.Series

In [20]:
# .カラム名でも表示できるが、基本的には非推奨。
# カラム名にスペースがある場合に打てなくなってしまう。
# また、.はすでに定義されている関数を呼び出すために利用するため。カラムを呼び出すのには使わない。
df.revenue

0       2787965087
1        961000000
2        880674609
3       1084939099
4        284139100
           ...
4798       2040920
4799             0
4800             0
4801             0
4802             0
Name: revenue, Length: 4803, dtype: int64